In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
data = np.random.randint(20,100, size=50)

In [4]:
data

array([91, 77, 62, 56, 44, 79, 20, 89, 59, 94, 31, 86, 79, 44, 68, 73, 77,
       83, 96, 37, 71, 34, 31, 63, 22, 58, 28, 65, 88, 55, 26, 30, 38, 80,
       60, 87, 64, 39, 91, 45, 64, 67, 50, 71, 76, 40, 49, 69, 24, 46])

In [5]:
df = pd.DataFrame(data, columns = ['A'])
df.tail()

     A
45  40
46  49
47  69
48  24
49  46

In [6]:
df.head()

    A
0  91
1  77
2  62
3  56
4  44

In [7]:
# Adding one more column 
data1 = np.random.randint(-50,50, size = 50)

In [8]:
df['B'] = data1
df.head()

    A   B
0  91  49
1  77  -5
2  62  22
3  56  44
4  44  22

In [9]:
# Adding a third column
data2 = np.random.randint(110,170, size = 50)

In [10]:
df['C'] = data2
df.head()

    A   B    C
0  91  49  160
1  77  -5  152
2  62  22  134
3  56  44  133
4  44  22  157

In [11]:
df = pd.DataFrame(randn(5,4),index= 'A B C D E'.split(" "),columns= 'X Y Z W'.split(" "))

In [12]:
df.head()

          X         Y         Z         W
A -0.494927  1.277896  0.038667 -0.430560
B  1.072560  0.998068  1.228446 -0.809835
C -0.169369  0.463666 -0.440254  0.721016
D -0.434913 -0.780051  0.874259  0.867277
E -0.266327 -0.090903 -1.726803  1.106192

In [13]:
df = pd.DataFrame(randn(5,4),index= 'A/B/C/D/E'.split("/"),columns= 'X*Y*Z*W'.split("*"))
df.head()

          X         Y         Z         W
A -1.225744 -1.451331 -0.659887  1.580038
B -0.608178 -1.462948 -0.858922 -1.109464
C -0.265673  0.766390  0.950819  1.440794
D  0.109286  0.595527 -0.546931 -1.010402
E  0.477122  1.221871  0.655995  0.241874

In [14]:
df['Y']

A   -1.451331
B   -1.462948
C    0.766390
D    0.595527
E    1.221871
Name: Y, dtype: float64

In [15]:
df[['X','W']]

          X         W
A -1.225744  1.580038
B -0.608178 -1.109464
C -0.265673  1.440794
D  0.109286 -1.010402
E  0.477122  0.241874

In [16]:
df.iloc[0]

X   -1.225744
Y   -1.451331
Z   -0.659887
W    1.580038
Name: A, dtype: float64

 # Selecting rows

In [17]:
df.iloc[2:5]

          X         Y         Z         W
C -0.265673  0.766390  0.950819  1.440794
D  0.109286  0.595527 -0.546931 -1.010402
E  0.477122  1.221871  0.655995  0.241874

In [18]:
df>-1

       X      Y     Z      W
A  False  False  True   True
B   True  False  True  False
C   True   True  True   True
D   True   True  True  False
E   True   True  True   True

In [19]:
df_1 = df[df>0]

In [20]:
df_1.head()

          X         Y         Z         W
A       NaN       NaN       NaN  1.580038
B       NaN       NaN       NaN       NaN
C       NaN  0.766390  0.950819  1.440794
D  0.109286  0.595527       NaN       NaN
E  0.477122  1.221871  0.655995  0.241874

In [21]:
df_1.isnull().sum()

X    3
Y    2
Z    3
W    2
dtype: int64

In [22]:
df_1.isna().sum()

X    3
Y    2
Z    3
W    2
dtype: int64

In [23]:
new_columns = ['Col1', 'Col2', 'Col3', 'Col4']

In [24]:
df.columns = new_columns

In [25]:
df.head(1)

       Col1      Col2      Col3      Col4
A -1.225744 -1.451331 -0.659887  1.580038

In [26]:
df_1.columns = new_columns

In [27]:
df_1.head(3)

   Col1     Col2      Col3      Col4
A   NaN      NaN       NaN  1.580038
B   NaN      NaN       NaN       NaN
C   NaN  0.76639  0.950819  1.440794

In [28]:
df_1.isna().sum()

Col1    3
Col2    2
Col3    3
Col4    2
dtype: int64

In [29]:
df['new'] = df['Col1'] + df['Col3']
df.head()

       Col1      Col2      Col3      Col4       new
A -1.225744 -1.451331 -0.659887  1.580038 -1.885630
B -0.608178 -1.462948 -0.858922 -1.109464 -1.467100
C -0.265673  0.766390  0.950819  1.440794  0.685146
D  0.109286  0.595527 -0.546931 -1.010402 -0.437644
E  0.477122  1.221871  0.655995  0.241874  1.133118

In [30]:
df['Minus'] = df['new'] - df['Col4']
df.head()

       Col1      Col2      Col3      Col4       new     Minus
A -1.225744 -1.451331 -0.659887  1.580038 -1.885630 -3.465668
B -0.608178 -1.462948 -0.858922 -1.109464 -1.467100 -0.357636
C -0.265673  0.766390  0.950819  1.440794  0.685146 -0.755648
D  0.109286  0.595527 -0.546931 -1.010402 -0.437644  0.572758
E  0.477122  1.221871  0.655995  0.241874  1.133118  0.891244

In [31]:
df.columns
# this will return the columns name

Index(['Col1', 'Col2', 'Col3', 'Col4', 'new', 'Minus'], dtype='object')

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    5 non-null      float64
 1   Col2    5 non-null      float64
 2   Col3    5 non-null      float64
 3   Col4    5 non-null      float64
 4   new     5 non-null      float64
 5   Minus   5 non-null      float64
dtypes: float64(6)
memory usage: 452.0+ bytes

In [33]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    2 non-null      float64
 1   Col2    3 non-null      float64
 2   Col3    2 non-null      float64
 3   Col4    3 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [34]:
df.describe()

           Col1      Col2      Col3      Col4       new     Minus
count  5.000000  5.000000  5.000000  5.000000  5.000000  5.000000
mean  -0.302637 -0.066098 -0.091785  0.228568 -0.394422 -0.622990
std    0.656611  1.290321  0.831354  1.286616  1.311016  1.724206
min   -1.225744 -1.462948 -0.858922 -1.109464 -1.885630 -3.465668
25%   -0.608178 -1.451331 -0.659887 -1.010402 -1.467100 -0.755648
50%   -0.265673  0.595527 -0.546931  0.241874 -0.437644 -0.357636
75%    0.109286  0.766390  0.655995  1.440794  0.685146  0.572758
max    0.477122  1.221871  0.950819  1.580038  1.133118  0.891244

In [35]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Col1,5.0,-0.302637,0.656611,-1.225744,-0.608178,-0.265673,0.109286,0.477122
Col2,5.0,-0.066098,1.290321,-1.462948,-1.451331,0.595527,0.766390,1.221871
Col3,5.0,-0.091785,0.831354,-0.858922,-0.659887,-0.546931,0.655995,0.950819
Col4,5.0,0.228568,1.286616,-1.109464,-1.010402,0.241874,1.440794,1.580038
new,5.0,-0.394422,1.311016,-1.885630,-1.467100,-0.437644,0.685146,1.133118
Minus,5.0,-0.622990,1.724206,-3.465668,-0.755648,-0.357636,0.572758,0.891244

In [36]:
df.loc['D']

Col1     0.109286
Col2     0.595527
Col3    -0.546931
Col4    -1.010402
new     -0.437644
Minus    0.572758
Name: D, dtype: float64

In [37]:
df.loc[['D','E']]

       Col1      Col2      Col3      Col4       new     Minus
D  0.109286  0.595527 -0.546931 -1.010402 -0.437644  0.572758
E  0.477122  1.221871  0.655995  0.241874  1.133118  0.891244

In [38]:
# selecting two rows and columns

In [39]:
df.loc[['A','B']][['Col2','Col4']]

       Col2      Col4
A -1.451331  1.580038
B -1.462948 -1.109464

In [40]:
df

       Col1      Col2      Col3      Col4       new     Minus
A -1.225744 -1.451331 -0.659887  1.580038 -1.885630 -3.465668
B -0.608178 -1.462948 -0.858922 -1.109464 -1.467100 -0.357636
C -0.265673  0.766390  0.950819  1.440794  0.685146 -0.755648
D  0.109286  0.595527 -0.546931 -1.010402 -0.437644  0.572758
E  0.477122  1.221871  0.655995  0.241874  1.133118  0.891244

In [41]:
df.new > -0.8

A    False
B    False
C     True
D     True
E     True
Name: new, dtype: bool

In [42]:
df = df[df> 0 ]

In [43]:
df

       Col1      Col2      Col3      Col4       new     Minus
A       NaN       NaN       NaN  1.580038       NaN       NaN
B       NaN       NaN       NaN       NaN       NaN       NaN
C       NaN  0.766390  0.950819  1.440794  0.685146       NaN
D  0.109286  0.595527       NaN       NaN       NaN  0.572758
E  0.477122  1.221871  0.655995  0.241874  1.133118  0.891244

In [44]:
df.style.highlight_null(null_color="red")

In [45]:
df.isna().sum()

Col1     3
Col2     2
Col3     3
Col4     2
new      3
Minus    3
dtype: int64

In [46]:
df.drop('new', axis = 1, inplace = True)
df

       Col1      Col2      Col3      Col4     Minus
A       NaN       NaN       NaN  1.580038       NaN
B       NaN       NaN       NaN       NaN       NaN
C       NaN  0.766390  0.950819  1.440794       NaN
D  0.109286  0.595527       NaN       NaN  0.572758
E  0.477122  1.221871  0.655995  0.241874  0.891244